cv.org
#+TITLE: Can Aknesil's CV
#+AUTHOR: Can Aknesil
#+OPTIONS: toc:nil author:nil date:nil num:nil title:nil
#+LATEX_CLASS_OPTIONS: [10pt]
# #+LATEX_HEADER: \usepackage[scaled]{helvet}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \renewcommand\familydefault{\sfdefault}
#+LATEX_HEADER: \usepackage[left=1.0in,right=1.0in,top=1.0in,bottom=1.5in]{geometry}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \titleformat{\section}{\LARGE\sffamily\bfseries}{\thesection}{0.5em}{}[{\titlerule[0.4pt]}]
#+LATEX_HEADER: \titleformat{\subsection}{\Large\sffamily\bfseries}{\thesection}{1em}{}[{\titlerule[0.4pt]}]
#+LATEX_HEADER: \titleformat{\subsubsection}{\large\sffamily\bfseries}{\thesection}{1em}{}[{\titlerule[0.4pt]}]
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \hypersetup{colorlinks=true, linkcolor=blue, urlcolor=blue, filecolor=blue}
#+LATEX_HEADER: \usepackage{enumitem}
#+LATEX_HEADER: \setlength{\parindent}{0pt}
#+LATEX_HEADER: \setlength{\parskip}{10pt}
#+LATEX_HEADER: \usepackage{setspace}
#+LATEX_HEADER: \setstretch{1.12}
#+LATEX_HEADER: \AtBeginDocument{\raggedright}
#+LATEX_HEADER: \AtBeginDocument{\clubpenalty=10000}  % Prevents first line of paragraph at the bottom of a page
#+LATEX_HEADER: \AtBeginDocument{\widowpenalty=10000} % Prevents last line of paragraph at the top of a page
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="github.css" />


* CV
29 September 2025

* Can Aknesil
Kungliga Tekniska H\ouml{}gskolan, SE-100 44 STOCKHOLM\\
[[mailto:aknesil@kth.se][aknesil@kth.se]]\\
[[https://www.canaknesil.com][www.canaknesil.com]]

** EDUCATION

*Doctoral Study in Information and Communication Technology* @@latex:\hfill@@ /2021 – 2025/\\
KTH Royal Institute of Technology, Stockholm\\
School of Electrical Engineering and Computer Science\\
Specialization: Electronic Systems\\
Title: Protecting Remote FPGAs and Embedded Devices from Non-Invasive Physical Attacks\\
Supervisor: Prof. Elena Dubrova

*Master of Science in Embedded Systems (Platform track)* @@latex:\hfill@@ /2018 – 2020/\\
KTH Royal Institute of Technology, Stockholm\\
School of Electrical Engineering and Computer Science

*Bachelor of Science in Electrical & Electronics Engineering* @@latex:\hfill@@ /2013 – 2018/\\
*Double Major in Computer Engineering*\\
Koç University, Istanbul\\
College of Engineering\\
(25% Scholarship)\\
GPA: 3.44 / 4\\
Vehbi Koç Scholar in 2014 and 2016\\
Member of [[https://parcorelab.ku.edu.tr/][Koç University - Parallel and Multicore Computing Laboratory]]
# September 2016 – March 2018

*High School* @@latex:\hfill@@ /2008 – 2013/\\
Notre Dame de Sion French High School, Istanbul 

** PUBLICATIONS

[[https://www.diva-portal.org/smash/record.jsf?pid=diva2%3A1958212&dswid=2918][Can Aknesil. "Protecting Remote FPGAs and Embedded Devices from Non-Invasive Physical Attacks". Doctoral Thesis, Royal Institute of Technology (KTH), Stockholm, Sweden. 2025.]]

[[https://eprint.iacr.org/2025/673][Can Aknesil, Elena Dubrova, Niklas Lindskog, Jakob Sternby, Håkan Englund. "Hybrid Fingerprinting for Effective Detection of Cloned Neural Networks". Cryptology ePrint Archive, Paper 2025/673, 2025.]]

[[https://ieeexplore.ieee.org/document/11038304][Can Aknesil, Elena Dubrova, Niklas Lindskog, Jakob Sternby, Håkan Englund. "Hybrid Fingerprinting for Effective Detection of Cloned Neural Networks". 2025 IEEE 55th International Symposium on Multiple-Valued Logic (ISMVL). 2025.]]

[[https://doi.ieeecomputersociety.org/10.1109/DSD64264.2024.00055][Can Aknesil, Elena Dubrova. "Circuit Disguise: Detecting Malicious Circuits in Cloud FPGAs without IP Disclosure". 2024 27th Euromicro Conference on Digital System Design (DSD). 2024.]]

[[https://doi.org/10.1109/TrustCom60117.2023.00259][Can Aknesil, Elena Dubrova, Niklas Lindskog and Håkan Englund. "A Near-Field EM Sensor Implemented in FPGA Configurable Fabric". 2023 IEEE 22nd International Conference on Trust, Security and Privacy in Computing and Communications (TrustCom). 2023.]]

[[https://doi.org/10.1109/IPDPSW59300.2023.00025][Can Aknesil, Elena Dubrova, Niklas Lindskog and Håkan Englund. "Is Your FPGA Transmitting Secrets: Covert Antennas from Interconnect". 2023 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW). 2023.]]

[[https://doi.org/10.1109/VLSI-SoC54400.2022.9939649][Can Aknesil and Elena Dubrova. "Towards Generic Power/EM Side-Channel Attacks: Memory Leakage on General-Purpose Computers". 2022 IFIP/IEEE 30th International Conference on Very Large Scale Integration (VLSI-SoC). 2022.]]

[[https://doi.org/10.1109/ISMVL51352.2021.00035][Can Aknesil and Elena Dubrova. "An FPGA Implementation of 4x4 Arbiter PUF". 2021 IEEE 51st International Symposium on Multiple-Valued Logic (ISMVL). 2021.]]

[[http://www.diva-portal.org/smash/record.jsf?pid=diva2%3A1460662][Can Aknesil. "An FPGA Implementation of Arbiter PUF with 4x4 Switch Blocks". Master's Thesis, Royal Institute of Technology (KTH), Stockholm, Sweden. 2020.]]

[[https://www.canaknesil.com/docs/MAM_A_Memory_Allocation_Manager_for_GPUs.pdf][Can Aknesil and Didem Unat. "MAM: A Memory Allocation Manager for GPUs". 5. Ulusal Yüksek Başarımlı Hesaplama Konferansı, Istanbul, Turkey. September, 2017.]]

** PROFESSIONAL EXPERIENCE

*Postdoctoral Researcher* @@latex:\hfill@@ /June 2025 – Present/\\
[[https://www.kth.se/en][KTH (Royal Institute of Technology)]], Stockholm\\
School of Electrical Engineering and Computer Science\\
Department of Computer Science\\
Division of Network and Systems Engineering

*Doctoral Student* @@latex:\hfill@@ /March 2021 – June 2025/\\
[[https://www.kth.se/en][KTH (Royal Institute of Technology)]], Stockholm\\
School of Electrical Engineering and Computer Science\\
Department of Electrical Engineering\\
Division of Electronics and Embedded Systems

*Research Engineer* @@latex:\hfill@@ /June 2020 – January 2021/\\
[[https://www.kth.se/en][KTH (Royal Institute of Technology)]], Stockholm\\
School of Electrical Engineering and Computer Science

*Intern* @@latex:\hfill@@ /June 2019 – November 2019/\\
[[https://www.ericsson.com/en][Telefonaktiebolaget LM Ericsson]], Stockholm\\
High Performance Broadband/Radio Software Department

*Intern* @@latex:\hfill@@ /July 2017 – September 2017/\\
[[http://www.ctech.com.tr][CTech Bilişim Teknolojileri San. ve Tic. A.Ş.]], Istanbul\\
Hardware Department

*Mentor Student* @@latex:\hfill@@ /February 2017 – June 2017/\\
[[https://it.ku.edu.tr][Koç University]], Instanbul\\
IT Department\\
Communication and Infrastructure Services

*Intern* @@latex:\hfill@@ /July 2016 – August 2016/\\
[[http://obss.com.tr][OBSS]], Istanbul\\
Technology Department

** TEACHING EXPERIENCE

*Guest Lecturer* @@latex:\hfill@@ /September 2025/\\
[[https://www.kth.se/en][KTH (Royal Institute of Technology)]], Stockholm\\
Course titled Digital Forensics and Incident Response (EP2780)

*Teaching Assistant* (during doctoral studies and later as postdoc) @@latex:\hfill@@ /March 2021 - Present/\\
[[https://www.kth.se/en][KTH (Royal Institute of Technology)]], Stockholm\\
School of Electrical Engineering and Computer Science\\
Department of Electrical Engineering\\
Division of Electronics and Embedded Systems

*Undergraduate Teaching Assistant* @@latex:\hfill@@ /September 2017 – January 2018/\\
[[https://eng.ku.edu.tr/en/][Koç University]], Istanbul\\
College of Engineering\\
Supervisor: Deniz Yüret

*Section Leader* @@latex:\hfill@@ /June 20 – 30, 2016/\\
[[https://www.stanford.edu/][Stanford University]] & [[https://eng.ku.edu.tr/en/][Koç University]], Istanbul\\
[[http://www.csbridge.org][CS Bridge Program]]

