cv.org
** LANGUAGE SKILLS

*Turkish:* Native language

*English:* IELTS in 2018 (Overall: 6.0, Listening: 6.0, Reading: 6.5, Writing: 5.0, Speaking: 5.5), TOEFL IBT in 2017 (Overall: 88, Listening: 27, Reading: 22, Writing: 22, Speaking: 17)

*Swedish:* SFI Course C in 2021 (roughly corresponds to CEFR A2/A2+), KTH Swedish C1 for Employees in 2025

*French:* DELF B2 in 2012 (Overall: 57.5/100, Listening: 11/25, Reading: 12.5/25, Writing: 18/25, Speaking: 16/25)

** PROFESSIONAL SKILLS

Hardware security\\
#+ATTR_LATEX: :options [noitemsep, topsep=2pt]
- Power/EM side-channel attacks
  (simple, differential, ML-based, and remote power analysis on FPGAs and microcontrollers)
- Microarchitectural side-channel attacks
- FPGA security
- Machine learning security

Computer security\\
#+ATTR_LATEX: :options [noitemsep, topsep=2pt]
- Machine learning security
- Penetration testing
- Networking and network security
  
Hardware design & development\\
#+ATTR_LATEX: :options [noitemsep, topsep=2pt]
- FPGA design and verification with VHDL and SystemVerilog
  (using Xilinx and Intel (Altera) design tools)
- Tcl scripting in Xilinx Vivado environment
- RTL synthesis with Yosys
- Graph-bases analysis of digital circuits

Embedded systems design & development\\
#+ATTR_LATEX: :options [noitemsep, topsep=2pt]
- Embedded real-time platform and software development with Nios II soft-processor and MicroC/OS
- Embedded software development with Linux
- Embedded software development directly on processor in AVR Assembly, MIPS Assembly, ARM Assembly, C, and C++
- Fault-tolerant systems design

High-performance computing (HPC)\\
#+ATTR_LATEX: :options [noitemsep, topsep=2pt]
- Parallel programming with pthread library, MPI, CUDA, and MicroC/OS

Computer science\\
#+ATTR_LATEX: :options [noitemsep, topsep=2pt]
- Scientific programming
- Machine Learning (supervised and unsupervised)
- Proficiency in Linux (personal use, system administration, driver and application development)
- Compiler and interpreter design with Lex (Lexical Analyzer), Yacc (Parser), LLVM (Optimization development), and PLY (Python Lex-Yacc)
- Version control with Git and Subversion
- Build automation with GNU Make, and CMake
- Proficiency in Office Programs
- LaTeX

Programming/scripting languages\\
#+ATTR_LATEX: :options [noitemsep, topsep=2pt]
- C, C++, Rust, Java, Julia, Python, Matlab, Lisp, Haskell, Bash, PowerShell, Tcl

Various other areas I have experimented\\
#+ATTR_LATEX: :options [noitemsep, topsep=2pt]
- PCB design using KiCad
- Mixed-signal IC design using Cadence Virtuoso
- Image analysis and computer vision
- Mobile application development for IOS (Objective – C) and Android (Java)
- Web development with HTML, JavaScript, CSS, PHP, Java EE, and Django
- Database design with SQL and MongoDB
- Circuit development for audio applications
- Electronic circuit simulation with PSpice and LTspice
- Emacs lisp programming

** PROJECTS
(From the most recent to the earliest)

- Detection and mitigation of speculative microarchitectural side channels with LLVM. /(KTH Postdoc)/
- [[https://github.com/canaknesil/hybrid-fingerprinting-ext][Hybrid fingerprinting (via power side-channel analysis) of neural networks]] /(Doctoral Study)/
- [[https://github.com/canaknesil/go-game][Go (board game, not the programming language) computer game in Rust]] /(Independent)/
- [[https://github.com/canaknesil/CircuitDisguise.jl][Circuit Disguise: Detecting Malicious Circuits in Cloud FPGAs without IP Disclosure]] /(Doctoral Study)/
- [[https://github.com/canaknesil/fpga-em-sensor][Near-field EM sensor implementations in FPGA configurable fabric]] /(Doctoral Study)/
- [[https://github.com/canaknesil/antenna-from-interconnect/][Covert antenna implementations on FPGA interconnect]] /(Doctoral Study)/
- [[https://github.com/canaknesil/rpi3-memory-leakage][Side-channel attacks on memory operations of general purpose computers]] /(Doctoral Study)/
- Side-channel attacks on Xilinx Artix-7 FPGA bitstream encryption engine /(Doctoral Study)/
- Bitstream Extraction from SPI Flash Communication /(Doctoral Study)/
- Breaking Advanced Encryption Standard (AES) on FPGA via power side-channel attack combined with deep learning /(KTH Employment)/
- Machine Learning modeling attacks on Physically Unclonable Functions (PUFs) /(KTH Employment)/
- [[https://github.com/canaknesil/4x4-apuf][FPGA implementation and statistical analysis of Arbiter PUF with 4x4 Switch Blocks]] /(MSc. Embedded Systems thesis, under the supervision of Elena Dubrova)/
- Single-Event Upset Detector (SEUD) Experiment in [[https://mistsatellite.space/][the Miniature Student Satellite (MIST)]] /(MSc. Embedded Systems final project)/
- Robust Header Compression (RoHC) for Profile 6 (TCP/IP) /(Ericsson internship)/
- Interfacing C++ high-performance radio simulation libraries from Julia, using Cxx.jl /(Ericsson summer internship)/
- [[https://github.com/canaknesil/snowflake-with-cuda][CUDA Compilation Support for Snowflake DSL]] /(Computer Engineering Final Project)/
- [[https://github.com/canaknesil/limon][Limon]]: A simple and powerful general purpose programming language /(Independent)/
- Programmable clock generator chip, RF receiver chip, and RF transmitter chip programming via BeagleBone Black /(CTech internship)/
- [[https://github.com/canaknesil/fpga-fir-filter-generator][FPGA C++ Framework for FIR Filtering Applications]] /(Electrical & Electronics Engineering Final Project)/
- [[https://github.com/canaknesil/mam][MAM: A Memory Allocation Manager for GPUs]], in C, compatible with C++ and CUDA [[https://parcorelab.ku.edu.tr/][/(ParCoreLab)/]]
- HR Job Advert & Application Management Web Application, in Java /(OBSS Summer Internship)/
- [[https://github.com/canaknesil/cannons-algorithm-mpi][Cannon’s matrix multiplication algorithm, in C, using MPI library]] /(Independent)/
- Unix-style operating system shell, in C, on Linux /(During undergraduate study)/
- Air traffic control simulator, in C++, using pthread.h library /(During undergraduate study)/
- Cache simulator, in C /(During undergraduate study)/
- Sound Transmission via Amplitude Modulation of Light, electronic circuit and simulation on PSpice /(During undergraduate study)/
- Digital clock, on FPGA board using VHDL /(During undergraduate study)/

A subset of my projects can be found [[https://github.com/canaknesil][here]].

** AWARDS

- Vehbi Koç Scholar 2014, 2016
- International mathematical competition named "Le Kangourou des mathématiques", 22th among 10627 participants, 2011

