output/cv.html

<div id="outline-container-org5934600" class="outline-4">
<h4 id="org5934600">Research Lab Membership</h4>
<div class="outline-text-4" id="text-org5934600">
<p>
<a href="https://parcorelab.ku.edu.tr/"><b>Koç University - Parallel and Multicore Computing Laboratory</b></a> <i>September 2016 – March 2018</i><br />
Koç University, Istanbul, Turkey<br />
Lab Member
</p>
</div>
</div>
</div>

<div id="outline-container-org16acf4b" class="outline-3">
<h3 id="org16acf4b">SKILLS</h3>
<div class="outline-text-3" id="text-org16acf4b">
</div>
<div id="outline-container-org8d1e45b" class="outline-4">
<h4 id="org8d1e45b">Language</h4>
<div class="outline-text-4" id="text-org8d1e45b">
<p>
<b>Turkish:</b> Native language
</p>

<p>
<b>English:</b> IELTS in 2018 (Overall: 6.0, Listening: 6.0, Reading: 6.5, Writing: 5.0, Speaking: 5.5), TOEFL IBT in 2017 (Overall: 88, Listening: 27, Reading: 22, Writing: 22, Speaking: 17)
</p>

<p>
<b>French:</b> DELF B2 in 2012 (Overall: 57.5/100, Listening: 11/25, Reading: 12.5/25, Writing: 18/25, Speaking: 16/25)
</p>

<p>
<b>Swedish:</b> SFI Course C in 2021 (roughly corresponds to CEFR A2/A2+), KTH Swedish B2 for Employees in 2024
</p>
</div>
</div>

<div id="outline-container-org63d98a1" class="outline-4">
<h4 id="org63d98a1">Electronics Engineering &amp; Computer Science</h4>
<div class="outline-text-4" id="text-org63d98a1">
<p>
Hardware security<br />
</p>
<ul class="org-ul">
<li>Power/EM side-channel attacks
(simple, differential, ML-based, and remote power analysis on FPGAs and microcontrollers)</li>
<li>FPGA security</li>
<li>Machine learning security</li>
</ul>

<p>
Computer security<br />
</p>
<ul class="org-ul">
<li>Machine learning security</li>
<li>Penetration testing</li>
<li>Networking and network security</li>
</ul>

<p>
Hardware design &amp; development<br />
</p>
<ul class="org-ul">
<li>FPGA design and verification with VHDL and SystemVerilog
(using Xilinx and Intel (Altera) design tools)</li>
<li>Tcl scripting in Xilinx Vivado environment</li>
<li>RTL synthesis with Yosys</li>
<li>Graph-bases analysis of digital circuits</li>
</ul>

<p>
Embedded systems design &amp; development<br />
</p>
<ul class="org-ul">
<li>Embedded real-time platform and software development with Nios II soft-processor and MicroC/OS</li>
<li>Embedded software development with Linux</li>
<li>Embedded software development directly on processor in AVR Assembly, MIPS Assembly, ARM Assembly, C, and C++</li>
<li>Fault-tolerant systems design</li>
</ul>

<p>
High-performance computing (HPC)<br />
</p>
<ul class="org-ul">
<li>Parallel programming with pthread library, MPI, CUDA, and MicroC/OS</li>
</ul>

<p>
Computer science<br />
</p>
<ul class="org-ul">
<li>Scientific programming</li>
<li>Machine Learning (supervised and unsupervised)</li>
<li>Proficiency in Linux (personal use, system administration, driver and application development)</li>
<li>Compiler and interpreter design with Lex (Lexical Analyzer), Yacc (Parser), and PLY (Python Lex-Yacc)</li>
<li>Version control with Git and Subversion</li>
<li>Build automation with GNU Make</li>
<li>Proficiency in Office Programs</li>
<li>LaTeX</li>
</ul>

<p>
Programming/scripting languages<br />
</p>
<ul class="org-ul">
<li>C, C++, Rust, Java, Julia, Python, Matlab, Lisp, Haskell, Bash, PowerShell</li>
</ul>

<p>
Various other areas I have experimented<br />
</p>
<ul class="org-ul">
<li>PCB design using KiCad</li>
<li>Mixed-signal IC design using Cadence Virtuoso</li>
<li>Image analysis and computer vision</li>
<li>Mobile application development for IOS (Objective – C) and Android (Java)</li>
<li>Web development with HTML, JavaScript, CSS, PHP, Java EE, and Django</li>
<li>Database design with SQL and MongoDB</li>
<li>Circuit development for audio applications</li>
<li>Electronic circuit simulation with PSpice and LTspice</li>
<li>Emacs lisp programming</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgac0ddbf" class="outline-3">
<h3 id="orgac0ddbf">PROJECTS</h3>
<div class="outline-text-3" id="text-orgac0ddbf">
<p>
(From the most recent to the earliest)
</p>

<ul class="org-ul">
<li><a href="https://github.com/canaknesil/go-game">Go (board game, not the programming language) computer game in Rust</a> <i>(Independent)</i></li>
<li><a href="https://github.com/canaknesil/CircuitDisguise.jl">Circuit Disguise: Detecting Malicious Circuits in Cloud FPGAs without IP Disclosure</a> <i>(Doctoral Study)</i></li>
<li><a href="https://github.com/canaknesil/fpga-em-sensor">Near-field EM sensor implementations in FPGA configurable fabric</a> <i>(Doctoral Study)</i></li>
<li><a href="https://github.com/canaknesil/antenna-from-interconnect/">Covert antenna implementations on FPGA interconnect</a> <i>(Doctoral Study)</i></li>
<li><a href="https://github.com/canaknesil/rpi3-memory-leakage">Side-channel attacks on memory operations of general purpose computers</a> <i>(Doctoral Study)</i></li>
<li>Side-channel attacks on Xilinx Artix-7 FPGA bitstream encryption engine <i>(Doctoral Study)</i></li>
<li>Bitstream Extraction from SPI Flash Communication <i>(Doctoral Study)</i></li>
<li>Breaking Advanced Encryption Standard (AES) on FPGA via power side-channel attack combined with deep learning <i>(KTH Employment)</i></li>
<li>Machine Learning modeling attacks on Physically Unclonable Functions (PUFs) <i>(KTH Employment)</i></li>
<li><a href="https://github.com/canaknesil/4x4-apuf">FPGA implementation and statistical analysis of Arbiter PUF with 4x4 Switch Blocks</a> <i>(MSc. Embedded Systems thesis, under the supervision of Elena Dubrova)</i></li>
<li>Single-Event Upset Detector (SEUD) Experiment in <a href="https://mistsatellite.space/">the Miniature Student Satellite (MIST)</a> <i>(MSc. Embedded Systems final project)</i></li>
<li>Robust Header Compression (RoHC) for Profile 6 (TCP/IP) <i>(Ericsson internship)</i></li>
<li>Interfacing C++ high-performance radio simulation libraries from Julia, using Cxx.jl <i>(Ericsson summer internship)</i></li>
<li><a href="https://github.com/canaknesil/snowflake-with-cuda">CUDA Compilation Support for Snowflake DSL</a> <i>(Computer Engineering Final Project)</i></li>
<li><a href="https://github.com/canaknesil/limon">Limon</a>: A simple and powerful general purpose programming language <i>(Independent)</i></li>
<li>Programmable clock generator chip, RF receiver chip, and RF transmitter chip programming via BeagleBone Black <i>(CTech internship)</i></li>
<li><a href="https://github.com/canaknesil/fpga-fir-filter-generator">FPGA C++ Framework for FIR Filtering Applications</a> <i>(Electrical &amp; Electronics Engineering Final Project)</i></li>
<li><a href="https://github.com/canaknesil/mam">MAM: A Memory Allocation Manager for GPUs</a>, in C, compatible with C++ and CUDA <a href="https://parcorelab.ku.edu.tr/"><i>(ParCoreLab)</i></a></li>
<li>HR Job Advert &amp; Application Management Web Application, in Java <i>(OBSS Summer Internship)</i></li>
<li><a href="https://github.com/canaknesil/cannons-algorithm-mpi">Cannon’s matrix multiplication algorithm, in C, using MPI library</a> <i>(Independent)</i></li>
<li>Unix-style operating system shell, in C, on Linux <i>(During undergraduate study)</i></li>
<li>Air traffic control simulator, in C++, using pthread.h library <i>(During undergraduate study)</i></li>
<li>Cache simulator, in C <i>(During undergraduate study)</i></li>
<li>Sound Transmission via Amplitude Modulation of Light, electronic circuit and simulation on PSpice <i>(During undergraduate study)</i></li>
<li>Digital clock, on FPGA board using VHDL <i>(During undergraduate study)</i></li>
</ul>

<p>
A subset of my projects can be found <a href="https://github.com/canaknesil">here</a>.
</p>
</div>
</div>

<div id="outline-container-orga4f0c7b" class="outline-3">
<h3 id="orga4f0c7b">AWARDS</h3>
<div class="outline-text-3" id="text-orga4f0c7b">
<ul class="org-ul">
<li>Vehbi Koç Scholar 2014, 2016</li>
<li>International mathematical competition named "Le Kangourou des mathématiques", 22th among 10627 participants, 2011</li>
</ul>
</div>
</div>
