cv.org
** CONFERENCES & WORKSHOPS

- [[https://mvl.jpn.org/ISMVL2025/][IEEE 55st International Symposium on Multiple-Valued Logic (ISMVL)]]. Presented a research paper. /(2025)/
- [[https://dsd-seaa.com/dsd2024/][27th Euromicro Conference Series on Digital System Design]]. Presented a research paper. /(2024)/
- [[https://cysep.conf.kth.se/][Cybersecurity and Privacy (CySeP) Summer School]]. /(2024)/
- [[https://raw.necst.it/][30th Reconfigurable Architectures Workshop (RAW)]]. Presented a research paper. /(2023)/
- [[https://vlsisoc2022.com/][30th IFIP/IEEE International Conference on Very Large Scale Integration (VLSI-SoC)]]. Presented a research paper. /(2022)/
- [[http://www.fpgaworld.com/][FPGAworld Conference]] in Stockholm. /(2022)/
- [[http://www.mvl.jpn.org/ISMVL2021/][IEEE 51st International Symposium on Multiple-Valued Logic (ISMVL)]]. Presented a research paper. /(2021)/
- [[https://sscs.ieee.org/][Solid-State Circuits Directions Inaugural Workshop: Hardware Security]]. /(2020)/
- [[https://www.tecosa.center.kth.se/][TECoSA Federated Learning Workshop]]. /(2020)/
- [[http://www.fpgaworld.com/][FPGAworld Conference]] in Stockholm. /(2019)/
- [[http://www.fpgaworld.com/][FPGAworld Conference]] in Stockholm. /(2018)/
- [[http://www.basarim.org.tr][National High Performance Computing Conference (BAŞARIM)]] (Ulusal Yüksek Başarımlı Hesaplama Konferansı). Presented a research paper. /(2017)/

- Training named "Neuroscience for Leadership" at Kariyer.Net /(2017)/
- Training named "Idea Production Techniques" at Kariyer.Net /(2017)/
- Training named "Communication Mastery" at Kariyer.Net /(2017)/
- Training named "Personal Quality" at Kariyer.Net /(2017)/
- Training named "Sustainable Motivation" at Kariyer.Net /(2017)/
- Training named "Gamification" at Kariyer.Net /(2017)/

- Participated to workshop organized by NDS to "Istanbul Technical University Energy Institute Nuclear Researches Division". Observation of "ITU TRIGA Mark-II Training and Research Reactor". /(2012)/

** HOBBIES & INTERESTS

- Music: Piano, Oud (A Classical Turkish Musical Instrument), and Guitar
  - London College of Music Piano Examinations, Grade 5
  - Koç Orchestra, piano and keyboard, during 3 years. Performed 7 concerts
  - Water Clock (band), keyboard, during 1 year. Performed 2 concert

- Summer sports: Sailing, Windsurfing
  - Have an Amateur Yacht Captain License
  - Participated to optimist courses at Ataköy Marine
  - Participated to sailing education at Istanbul Sailing Club
  - Officially licensed, intermediate level windsurfer registered with the Turkish Sailing Federation.

- Tennis, Table tennis, Badminton
  - Table tennis team member in Notre Dame de Sion (high school)

- Winter sports: Skiing, Ice skating


