output/cv.html

<div id="outline-container-org93869da" class="outline-3">
<h3 id="org93869da">CONFERENCES &amp; WORKSHOPS</h3>
<div class="outline-text-3" id="text-org93869da">
<ul class="org-ul">
<li><a href="https://dsd-seaa.com/dsd2024/">27th Euromicro Conference Series on Digital System Design</a>. Presented a research paper. <i>(2024)</i></li>
<li><a href="https://cysep.conf.kth.se/">Cybersecurity and Privacy (CySeP) Summer School</a>. <i>(2024)</i></li>
<li><a href="https://raw.necst.it/">30th Reconfigurable Architectures Workshop (RAW)</a>. Presented a research paper. <i>(2023)</i></li>
<li><a href="https://vlsisoc2022.com/">30th IFIP/IEEE International Conference on Very Large Scale Integration (VLSI-SoC)</a>. Presented a research paper. <i>(2022)</i></li>
<li><a href="http://www.fpgaworld.com/">FPGAworld Conference</a> in Stockholm. <i>(2022)</i></li>
<li><a href="http://www.mvl.jpn.org/ISMVL2021/">IEEE 51st International Symposium on Multiple-Valued Logic (ISMVL)</a>. Presented a research paper. <i>(2021)</i></li>
<li><a href="https://sscs.ieee.org/">Solid-State Circuits Directions Inaugural Workshop: Hardware Security</a>. <i>(2020)</i></li>
<li><a href="https://www.tecosa.center.kth.se/">TECoSA Federated Learning Workshop</a>. <i>(2020)</i></li>
<li><a href="http://www.fpgaworld.com/">FPGAworld Conference</a> in Stockholm. <i>(2019)</i></li>
<li><a href="http://www.fpgaworld.com/">FPGAworld Conference</a> in Stockholm. <i>(2018)</i></li>
<li><a href="http://www.basarim.org.tr">National High Performance Computing Conference (BAŞARIM)</a> (Ulusal Yüksek Başarımlı Hesaplama Konferansı). Presented a research paper. <i>(2017)</i></li>

<li>Training named "Neuroscience for Leadership" at Kariyer.Net <i>(2017)</i></li>
<li>Training named "Idea Production Techniques" at Kariyer.Net <i>(2017)</i></li>
<li>Training named "Communication Mastery" at Kariyer.Net <i>(2017)</i></li>
<li>Training named "Personal Quality" at Kariyer.Net <i>(2017)</i></li>
<li>Training named "Sustainable Motivation" at Kariyer.Net <i>(2017)</i></li>
<li>Training named "Gamification" at Kariyer.Net <i>(2017)</i></li>

<li>Participated to workshop organized by NDS to "Istanbul Technical University Energy Institute Nuclear Researches Division". Observation of "ITU TRIGA Mark-II Training and Research Reactor". <i>(2012)</i></li>
</ul>
</div>
</div>

<div id="outline-container-org428590b" class="outline-3">
<h3 id="org428590b">HOBBIES &amp; INTERESTS</h3>
<div class="outline-text-3" id="text-org428590b">
<ul class="org-ul">
<li>Music: Piano, Oud (A Classical Turkish Musical Instrument), and Guitar
<ul class="org-ul">
<li>London College of Music Piano Examinations, Grade 5</li>
<li>Koç Orchestra, piano and keyboard, during 3 years. Performed 7 concerts</li>
<li>Water Clock (band), keyboard, during 1 year. Performed 2 concert</li>
</ul></li>

<li>Summer sports: Sailing, Windsurfing
<ul class="org-ul">
<li>Have an Amateur Yacht Captain License</li>
<li>Participated to optimist courses at Ataköy Marine</li>
<li>Participated to sailing education at Istanbul Sailing Club</li>
<li>Officially licensed, intermediate level windsurfer registered with the Turkish Sailing Federation.</li>
</ul></li>

<li>Tennis, Table tennis, Badminton
<ul class="org-ul">
<li>Table tennis team member in Notre Dame de Sion (high school)</li>
</ul></li>

<li>Winter sports: Skiing, Ice skating</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-02-09 Sun 14:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
